# CurrencyPerWatt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..CurrencyPerWatt Property
UnitTypeId Class See Also
---
Cost per watt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CurrencyPerWatt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurrencyPerWatt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurrencyPerWatt {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace